import jieba
import jieba.posseg as pseg
from collections import Counter
import math,operator

text_1="""
今年四月的时候，马克龙去找了默克尔一趟，希望建立欧盟财政部，并且由欧盟内富国负担对穷国的转移支付，结果遭到默克尔的公开拒绝。

这里的一个背景是2017年，欧盟最富的卢森堡，人均GDP已经是最穷的保加利亚的十倍（卢森堡：92800；保加利亚：7200）。如果限于欧元区内，则是最低的拉脱维亚的七倍（13900）。

由于欧元区的存在，区内小国的货币政策自主权完全丧失，几乎沦为德国的经济殖民地（如近两年德国对希腊的欺凌，造成了近乎公开的敌对）。在更大的欧盟层面来讲，欧盟内的统一市场和劳动力自由流动更加造成了经济上的不平衡。由于关税工具丧失，即使不在欧元区的欧盟国家也深受困扰。

对于中国这样的单一制国家，或者美国这样的联邦制国家而言，解决方法一般是转移支付。富裕地区上交财政来补贴落后地区。以中国为例，2004年向东部（尤其是上海）的补贴到达顶点，此后便改弦更张，改为向中西部补贴。没有转移支付，很多省份一年上千亿的刚性缺口会变成无底黑洞。

德国拒绝转移支付，基本上就是摆出了单方面吸血的姿态。除了经济上的压迫，还利用欧盟作为平台，在全欧洲强行推行自己的价值观和意识形态，俨然第四帝国再世了。

更甚者，为了德国独霸中东欧的目的，默克尔政府公然干涉中东欧国家的贸易和外交。之前希腊深受德国逼债，决定把资产以合理价格抛售给中国，结果德国火力全开攻击中国要分裂欧盟，逼迫希腊贱卖资产给德国。

从技术上讲，法国作为欧盟双核之一，是应该也有能力遏制德国的经济扩张的。然而法国经济疲软，政治混乱。希拉克的12年长期政权结束之后，连续两任总统都是一届便黯然下台。

相比之下，默克尔掌握德国政权十四年，德国经济更是靠着屠杀欧元区小国的产业，一洗九十年代的中欧病夫姿态，实现腾飞。在现在这个时间点上，法国从威望上还是组织力上都难以单独和德国抗衡。表现在外部，就体现为东欧各国在政治上采取了尖锐的不合作态度，尤其是针对德国推动的难民政策。

值得注意的是，法国和德国虽然都大量吸收移民，但是两者的移民政策根源是不一样的。法兰西吸收移民的重点仍然在于西非和中非，这些地区技术上仍然是法兰西帝国的一部分，普遍使用法语、货币受到法兰西银行控制、本土有法国驻军。相比之下，德国虽然和土耳其也有密切的历史联系，但是德国的移民政策仍然相较法国复杂和困难，从最近德国足球队的一系列风波就可以看出许多问题。叙利亚危机爆发之后，德国统治阶级利用难民经济大发其财，甚至将难民强行摊派到欧洲各国。结果就是，德国和一部分低地国家利用对欧盟机器的控制，统治阶级大发难民财，而社会动荡的代价很多都由中东欧国家承受了。

德国自己虽然也承受了一些社会动荡，但是很大程度上是自业自得。一方面，难民经济的受益者对难民不加甄别，不分良莠地引进以充人头数。另一方面，虽然德国给难民以一些补贴，但是并不给他们以工作许可；然而德国仍然图谋他们的劳动力，于是迫使他们以远低于最低工资的报酬从事劳动（技术上说这属于“补贴”而非工资，所以不受最低工资限制）以改善生活。两相叠加之下，社会矛盾自然尖锐。

这一系列操作的后果就是，成立二十多年的维谢格拉德集团，直到2014年还相对低调。但是以2014年匈牙利欧尔班政府第二次大选胜利为标志，维谢格拉德集团开始公开挑战柏林方面的政策路线，甚至不惜发出撕裂欧盟的威胁。这方面的新闻也很多了。最近一个就是前两天的波兰政府公开宣布不接受特定宗教背景的难民。

我无法查到确切证据表明维谢格拉德集团收受奥塞码头的补贴，但是法国外交部想必对这一系列操作乐见其成，甚至予以推波助澜，则是合乎逻辑的。毕竟，波兰、捷克、再加上最近转向背离德国路线的奥地利，在东方实现了对德国的全包围。这几国也长期扮演德国工业配套的角色（捷克尚有大量英国资本）。如果能对他们加以拉拢，对于牵制德国的经济扩张政策，意义是非常明显的。

如果维谢格拉德集团最近四五年的政策真的受到了奥塞码头的暗中支持甚至公开支持，那么可以说，它们就是新时代的小协约国了。因为波兰的加入，导致这个集团对德国的制约作用比历史上的小协约国看起来还要好得多了。虽然现在的世界局势并不允许法国和小协约国与德国直接爆发战争，但是经济和政治上的长期斗争是可以预见的。尤其是默克尔政府不愿意放弃他们继续向中东欧实行单边扩张的路线的情况下。

问题在于，小协约国在1939年没有能挡住第三帝国。在2018年，他们真的能挡住第四帝国吗？


"""

text_2="""
问题在于，小协约国在1939年没有能挡住第三帝国。在2018年，他们真的能挡住第四帝国吗？

可以预见的问题还是很多的。

首先，小协约国从本质上说，是俄罗斯的替代品。法国从地缘上说和俄国是天然盟友。整个冷战时代，法国都利用苏联来压制德国和低地的同时，平衡美国在欧洲的影响。在1989年戈尔巴乔夫的的改革进入自杀阶段后的几年，法国总统甚至多次飞往莫斯科请求挽救苏联。戴高乐主义的根基，乃是“美国可以统治世界，但不可以统治欧洲”。维谢格拉德集团的这几国，就算加上奥地利，其实力也不能和俄罗斯的一个零头相比。结果就是，现在法国别说平衡美国在欧洲的影响力了，连德国都要压不住了。维谢格拉德集团本身也深受美国渗透。这几个国家真的能帮助法国实现他们的外交路线吗？

其次，维谢格拉德集团和俄国之间矛盾重重。如上所述，小协约国只是本来由俄罗斯承担的东线的替代品。苏联解体之后，残余下来的俄罗斯和中欧没有直接的地理、经济和军事接触，所以才转而指望和德国接壤的维谢格拉德集团。要实行压制德国、平衡美国的外交路线，法国的用力焦点还是在莫斯科而非华沙的。但是维谢格拉德集团四国受苏联附庸统治几十年，对俄罗斯充满仇恨，直接制约了法国的外交路线。历史上的二战就以波兰拒绝苏联援助捷克为标志，走向了小协约国土崩瓦解的开局。

第三，德国和俄国勾勾搭搭。这次特朗普在访问欧洲的时候近乎公开地攻击了这一点。天然气贸易几乎成为了德俄关系的一块不可撼动的基石，也成了德俄之间勾勾搭搭的一条联络管道。德国当然明白维谢格拉德集团对自己东扩的威胁，也明白波兰和俄国之间深刻的仇恨，所以拉拢俄罗斯以势压人是非常天然的选择。对法国来说，小协约国只能是俄国的替代品，而且还是一个内部矛盾重重的替代品。如果连正主俄罗斯都倒向了第四帝国的那边，靠中东欧的这几个小国又能做成什么呢？

第四，遥远但是不可预知的中国因素。中国离欧洲很远，难以施加直接影响力，本来不应该成为一个因素的。但是注意到一个叫中国—中东欧国家领导人会晤的东西，又叫“1+16”领导人会晤。自2012年开始举办，一年一次。考虑到中国的巨大经济体量，和一带一路的经济西扩路线，中国很可能会变成中东欧局势的一个棋手。另一点是，不可否认中国对莫斯科有巨大的影响力（谈不上盟友，但是没有中国的经济支持普京早就被他手下那些外族军阀撕碎了），而莫斯科是法国整个东方战略的基石。而且，欧盟国家也在一带一路插了一脚，虽然有些顾虑重重最后没有当场签字。中国的态度现在还很模糊，但是可能是关键的。要看到，中国在希腊债务危机里是出手了的。
"""

text_3="""　
最后，我一句私货。科耶夫在法兰西国是纲要里面给法国设计的方略本来就是排除德国，以拉丁文明为基础建立地中海联盟的。然而无论是第四共和国还是第五共和国在这个问题上没有采纳科耶夫的意见，转而选择与德国合作，推进经济共同体的建设。也许欧盟的命运当初就已经注定了吧。

顺便说几句涉及我国的私货。我国和德国是有结构性矛盾的。德国的所有重头产业，几乎都是我国产业升级的目标。汽车、大型装备、运输，统统和我国要刚正面。

如果法国压不住德国，放出大德意志（未必是版图上，经济上就可以了）这个怪物来，对我国是一个重大的压力。

相比之下，美国和我国在贸易上结构性冲突相较于我国和德国小。美国的农产品、矿产和石油是我国需要的。美国压制我国产业升级，更多是宣传需要，而非产业结构上的矛盾。这个等中期选举过了是可以协调的。

其他的，俄罗斯现在这个版图其实很巧妙，和中美法德统统没有直接矛盾。要说的话，地缘态势是比苏联好了。就和第二帝国解体之后德意志的地缘态势比一战前好了一样。

"""



texts=[text_1.replace("\u3000","").replace("\n",""),text_2.replace("\u3000","").replace("\n",""),text_3.replace("\u3000","").replace("\n","")]
newslens=0

#文書の数を確認する
Ns=len(texts)

#分かち書きリストを作る（ここでは名詞だけを取る）
for j in range(Ns):
    words = pseg.cut(texts[j])
    locals()["wordlists"+str(j)]=[]
    for w in words:
        if w.flag in ["n","nt","ns","nr"]:
            locals()["wordlists"+str(j)].append(w.word)

    #頻出語辞書を作る
    locals()["fq_dict"+str(j)]=Counter(locals()["wordlists"+str(j)])
    
    #文書の長さを測る（ここでは名詞だけを取る）
    locals()["newslen"+str(j)]=len(locals()["wordlists"+str(j)])
    newslens+=locals()["newslen"+str(j)]
    
    #TFスコア辞書を作る (文書Djにおける単語Tiの出現回数) / (文書Djのの総単語数)
    locals()["tf_dict"+str(j)]=[]
    for (k,v) in locals()["fq_dict"+str(j)].most_common():
        v=v/locals()["newslen"+str(j)]
        locals()["tf_dict"+str(j)].append([k,v])
    locals()["tf_dict"+str(j)]=dict(locals()["tf_dict"+str(j)])

#単語Tiが出現する文書数の辞書を作る
allwords=[]
for j in range(Ns):
    for word in locals()["fq_dict"+str(j)]:
        allwords.append(word)
allwords=Counter(allwords)

#IDFスコア辞書を作る（log（N = 文書の総数/単語Tiが出現する文書数）[+1]）
idfdict=[]
for k,v in allwords.items():
    idf=math.log2(Ns/v)+1
    idfdict.append([k,idf])
idfdict=dict(idfdict)

#それぞれの文章のTF×IDFランキングを作る
for j in range(Ns):
    tfidfs=[]
    for k,v in locals()["tf_dict"+str(j)].items():
        tfidf=v*idfdict[k]
        tfidfs.append([k,tfidf])
    tfidfs=dict(tfidfs)
    locals()["tfidfrank"+str(j)]=sorted(tfidfs.items(), key=operator.itemgetter(1),reverse = True)

#それぞれの文章のTF×IDFランキングを示す
for j in range(Ns):
    print("文章",j+1,"のTF×IDFランキング：")
    for r in range(10):
        print(locals()["tfidfrank"+str(j)][r])

###################################################################
#BM25を計算する
#チューニングを設定する
bm_k=2
bm_b=0.75

#|DL|を計算する　NDL(j) = DL(j) / (すべての文書の平均DL)
avelen=newslens/Ns

#それぞれの文章のCWランキングを作る
#CW[i,j]=[tfidfrank[i,j]*(bm_k+1)]/[bm_k*(1-bm_b+(bm_b*NDL)+tf_dict(i,j)]
for j in range(Ns):
    cwlist=[]
    NDL=locals()["newslen"+str(j)]/avelen
    for i,v in locals()["tf_dict"+str(j)].items():
        tfidf=v*idfdict[i]
        cw=(tfidf*(bm_k+1))/(bm_k*(1-bm_b+(bm_b*NDL)+v))
        cwlist.append([i,cw])
        cwdict=dict(cwlist)
        locals()["cwrank"+str(j)]=sorted(cwdict.items(), key=operator.itemgetter(1),reverse = True)
        
#それぞれの文章のCWランキングを示す
for j in range(Ns):
    print("文章",j+1,"のCWランキング：")
    for r in range(10):
        print(locals()["cwrank"+str(j)][r])    